vlm/base/DataProcessors/бит_СостояниеОбеспеченияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_СостояниеОбеспеченияЗаказов</Name>
			<Comment>ЛТ5.35</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

vlm/base/InformationRegisters/ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПартия</Name>
					<Comment>Ключ связи, идентификатор узла структуры заказа</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказНаПроизводство2_2</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЗаказыНаПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.ФактическиеДанныеБюджетирования</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспечениеПроизводственныхПроцессов</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыИПотребности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>15</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПодДеятельность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказМатериаловВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДавальца2_5</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДавальца</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадействоватьРезервДоступности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПривязкиОперацийПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПотребностиУказываетсяВСтроках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбособления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОбособленияМатериаловВПроизводстве</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНеОбязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроизводственногоПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроизводственныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияЗатратНаВыходныеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияЗатратНаВыходныеИзделия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособлениеПолуфабрикатовПоНазначениюЭтаповНеИспользуется</Name>
					<Comment>Служебный реквизит для поддержки перехода с предыдущих версий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеОбеспечениеМатериаловИРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическаяСтруктура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УкрупненныйЗаказПоНазначениямПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторСтрока</Name>
					<Comment>Уникальный идентификатор ссылки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Comment>Уникальный идентификатор ссылки</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМаксимальныйКодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ВидЗаказа</Name>
					<Comment>ЛТ5.27</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипизацияЗаказовНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КлючЗагрузки</Name>
					<Comment>ЛТ5.27</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПотребности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтменыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимостиНаЕдиницу</Name>
							<Comment>Служебный реквизит для автоматического заполнения доли стоимости</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНаРасходы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаАктивовПассивов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/DataProcessors/бит_СостояниеОбеспеченияЗаказов/Forms/ФормаБронированияВЗапущенныхЗаказах/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаказКлиентаНомерОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(ЗаказКлиента);
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	
	Если КРаспределению = 0 Тогда
		Возврат;
	КонецЕсли;
	ТД = Элементы.ЗаказыНаПроизводство.ТекущиеДанные;
	Если ТД = Неопределено Или ТД.ДоступноКБронированию = 0 Тогда
		Возврат;
	КонецЕсли;
	Забронировано = 0;                                  
	
	ЗабронироватьНаСервере(ТД.ДоступноКБронированию, ЗаказКлиента, Номенклатура, ЗаказНаПроизводствоТекущий, Забронировано, КРаспределению);

	Если Забронировано > 0 Тогда   
		КРаспределению = КРаспределению - Забронировано;  
		ПерезаполнитьТЧЗаказа(ЗаказНаПроизводствоТекущий, ТД.ДоступноКБронированию); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗабронироватьНаСервере(Знач ДоступноКБронированию, ЗаказКлиента, Номенклатура, ЗаказНаПроизводство, Забронировано, КРаспределению) 
	                             
	// ДоступноКБронированию - сколько можно распределить по заказу на производство. это количество должно быть обособлено
	// проверим, что в заказе клиента для этой Номенклатуры указано обособление
	СтрокиЗаказаКлиента = ЗаказКлиента.Товары.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
	ОбособленныхВЗаказеКлиента = 0;  
	НеОбособленныхВЗаказеКлиента = 0;   
	мНеобособленныхСтрок = Новый Массив;     
	Дораспределено = 0;
		
	Для Каждого стр Из СтрокиЗаказаКлиента Цикл
		Если стр.Обособленно Тогда
			ОбособленныхВЗаказеКлиента = ОбособленныхВЗаказеКлиента + стр.Количество;
		Иначе
			мНеобособленныхСтрок.Добавить(стр);
			НеОбособленныхВЗаказеКлиента = НеОбособленныхВЗаказеКлиента + стр.Количество;
		КонецЕсли;
	КонецЦикла; 
	
	Если ОбособленныхВЗаказеКлиента < ДоступноКБронированию И НеОбособленныхВЗаказеКлиента > 0 Тогда // надо обособить в заказе клиента 
		КДораспределениюПоЗаказу = Мин(ДоступноКБронированию - ОбособленныхВЗаказеКлиента, НеОбособленныхВЗаказеКлиента);        
		Дораспределено = 0;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Из " + ЗаказКлиента + " возможно дополнительно обособить " + КДораспределениюПоЗаказу + " " + Номенклатура.ЕдиницаИзмерения);
		Если КДораспределениюПоЗаказу > 0 Тогда
		// найдем наиболее подходящую строку по заказу (вдруг их несколько)  
			ЗаказОбъект = ЗаказКлиента.ПолучитьОбъект();   
			СтрокиЗаказаКлиента = ЗаказОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура, Обособленно", Номенклатура, Ложь));
			
			СтруктураДействий = Новый Структура;
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЗаказОбъект);
			//ДобавитьДействияОбеспечения(СтруктураДействий, "ДоступноВДругихСтроках", ЗаказОбъект);
			
			Для Каждого стр Из СтрокиЗаказаКлиента Цикл
				Если стр.Количество <= КДораспределениюПоЗаказу Тогда
						// обособляем всю строку
						стр.Обособленно = Истина;                
						КДораспределениюПоЗаказу = КДораспределениюПоЗаказу - стр.Количество; 
						Дораспределено = Дораспределено + стр.Количество;
						// кусочек типового кода
						стр.ВариантОбеспечения = ОбеспечениеВДокументахКлиентСервер.ОбособленноПриИзменении(стр.Обособленно, стр.ВариантОбеспечения, стр.Номенклатура.ТипНоменклатуры);
					Иначе
						//разбиваем строку.
						нов = ЗаказОбъект.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(нов, стр, , "НомерСтроки, ИдентификаторСтроки, КлючСвязи, КодСтроки"); 
						
						стр.Обособленно = Истина;
						стр.КоличествоУпаковок = КДораспределениюПоЗаказу;  
						Дораспределено = Дораспределено + КДораспределениюПоЗаказу;
						// кусочек типового кода
						стр.ВариантОбеспечения = ОбеспечениеВДокументахКлиентСервер.ОбособленноПриИзменении(стр.Обособленно, стр.ВариантОбеспечения, стр.Номенклатура.ТипНоменклатуры);
						
						нов.КоличествоУпаковок  = стр.КоличествоУпаковок - КДораспределениюПоЗаказу;
						нов.ИдентификаторСтроки = Новый УникальныйИдентификатор;
						
						ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(стр, СтруктураДействий, Неопределено);
						ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(нов, СтруктураДействий, Неопределено);
						
						КДораспределениюПоЗаказу = 0; 
					КонецЕсли;
					
					Если КДораспределениюПоЗаказу = 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла; 
				
			//ДоступноКБронированию = ОбособленныхВЗаказеКлиента + Дораспределено;
			
			Попытка	  
				СвернутьСтрокиТЧТоварыЗаказаКлиента(ЗаказОбъект);
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);  
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В " + ЗаказКлиента + " дополнительно обособлено " + Дораспределено + " " + Номенклатура.ЕдиницаИзмерения);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сделать обособлене в " + ЗаказКлиента + " по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
				Возврат;
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	ДоступноКБронированию = Мин(ОбособленныхВЗаказеКлиента + Дораспределено, КРаспределению);
	
	// теперь найдем назначение
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Назначения.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Назначения КАК Назначения
	                      |ГДЕ
	                      |	Назначения.Заказ = &Заказ");
	Запрос.УстановитьПараметр("Заказ", ЗаказКлиента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Назначение = Выборка.Ссылка;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось найти назначение для " + ЗаказКлиента);
		Возврат;
	КонецЕсли;
	/// -------------------------------------------------------------------------------------------------
	// теперь в текущем заказе на производство надо указать назначение
	ЗаказНаПроизводствоОбъект = ЗаказНаПроизводство.ПолучитьОбъект();
	ЗабронированоТеоретически = 0;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
	Если ЗаказНаПроизводствоОбъект.ТипПроизводственногоПроцесса = ПредопределенноеЗначение("Перечисление.ТипыПроизводственныхПроцессов.БезСпецификаций") Тогда
		ПараметрыРаспределенияЗатрат = Новый ФиксированнаяСтруктура(Документы.ЗаказНаПроизводство2_2.ПараметрыРаспределенияЗатрат(ЗаказНаПроизводствоОбъект));
		СтруктураДействий.Вставить("ПроверитьЗаполнитьДолюСтоимости", ПараметрыРаспределенияЗатрат);
	КонецЕсли;
	
	Для каждого стр Из ЗаказНаПроизводствоОбъект.Продукция Цикл
		Если Не стр.Назначение.Пустая() Или стр.Номенклатура <> Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		Если стр.Количество <= ДоступноКБронированию Тогда
			стр.Назначение = Назначение;	        
			ДоступноКБронированию = ДоступноКБронированию - стр.Количество; 
			ЗабронированоТеоретически = ЗабронированоТеоретически + стр.Количество;
		Иначе                                                                      
			// разбиваем строку
			нов = ЗаказНаПроизводствоОбъект.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(нов, стр, , "НомерСтроки, КлючНоменклатура");
			стр.КоличествоУпаковок = ДоступноКБронированию;  
			стр.Назначение = Назначение;
			
			ЗабронированоТеоретически = ЗабронированоТеоретически + ДоступноКБронированию;      
			ДоступноКБронированию = 0;
			нов.КоличествоУпаковок = нов.КоличествоУпаковок - стр.КоличествоУпаковок; 
			нов.КлючНоменклатура = Новый УникальныйИдентификатор;
			
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(стр, СтруктураДействий, Неопределено);
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(нов, СтруктураДействий, Неопределено);
			
		КонецЕсли;
		Если ДоступноКБронированию = 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Попытка 
		ЗаказНаПроизводствоОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Забронировано = ЗабронированоТеоретически;         
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Забронировано " + Забронировано + " " + Номенклатура.ЕдиницаИзмерения);
	Исключение     
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать " + ЗаказНаПроизводство + " по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;  
	
КонецПроцедуры

//&НаСервереБезКонтекста
//Процедура ДобавитьДействияОбеспечения(СтруктураДействий, ПоляСтрокой, ЗаказОбъект)
//	
//	ПараметрыДокумента = Новый Структура();
//	ПараметрыДокумента.Вставить("Форма", 								 ЗаказОбъект);
//	ПараметрыДокумента.Вставить("Коллекция",                             ЗаказОбъект.Товары); 
//	
//	ВариантОбеспеченияПоУмолчанию = ВариантОбеспеченияПоУмолчанию(ЗаказОбъект);
//	
//	ВариантОбеспеченияИФлагОбособленно = ПродажиСервер.ВариантОбеспеченияИФлагОбособленноПоУмолчанию(
//		ЗаказОбъект.Соглашение,
//		ЗаказОбъект.Статус,
//		ВариантОбеспеченияПоУмолчанию,
//		Не ЗаказОбъект.ЭтоЗаказКакСчет);
//	
//	ПараметрыДокумента.Вставить("ВариантОбеспеченияИФлагОбособленно",    ВариантОбеспеченияИФлагОбособленно);
//	
//	ПараметрыВстраивания = Документы.ЗаказКлиента.ДоступныеОстаткиПараметрыВстраивания();
//	ОбеспечениеВДокументахСервер.ДоступныеОстаткиПриСозданииНаСервере(ЗаказОбъект, ПараметрыВстраивания);
//    ПараметрыДокумента.Вставить("ПараметрыВстраивания", ПараметрыВстраивания);
//	
//	ОбеспечениеВДокументахКлиентСервер.ДобавитьДействияОбеспечения(
//		СтруктураДействий,
//		ПоляСтрокой,
//		ПараметрыДокумента);
//	
//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ВариантОбеспеченияПоУмолчанию(ЗаказОбъект)
//	
//	ВариантИФлаг = Неопределено;
//	Если ЗаказОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала Тогда
//		ВариантИФлаг = Новый Структура("ВариантОбеспечения,Обособленно", Перечисления.ВариантыОбеспечения.КОбеспечению, Истина);
//	КонецЕсли;  
//	
//	Возврат ВариантИФлаг;
//	
//КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект)
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗависимыеРеквизиты()
	
	Возврат Новый Структура(
		"БезВозвратнойТары,ОтмененоБезВозвратнойТары,Отменено",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки,СуммаБонусныхБалловКСписаниюВВалюте",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки,СуммаБонусныхБалловКСписаниюВВалюте",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки,СуммаБонусныхБалловКСписаниюВВалюте");
	
КонецФункции

&НаКлиенте
Процедура СнятьБронь(Команда)
	
	ТД = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если ТД = Неопределено Или ТД.Назначение = ПредопределенноеЗначение("Справочник.Назначения.ПустаяСсылка") Тогда 
		Возврат;
	КонецЕсли;
	ОтменитьНазначениеВЗаказеНаПроизводствоНаСервере(ТД.НомерСтроки);
	
	ТекДанныеПоСтрокеЗаказа = Элементы.ЗаказыНаПроизводство.ТекущиеДанные;
	Если ТекДанныеПоСтрокеЗаказа <> Неопределено Тогда
		ПерезаполнитьТЧЗаказа(ЗаказНаПроизводствоТекущий, ТекДанныеПоСтрокеЗаказа.ДоступноКБронированию); 	
	Иначе                                                 
		ПерезаполнитьТЧЗаказа(ЗаказНаПроизводствоТекущий);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьНазначениеВЗаказеНаПроизводствоНаСервере(НомерСтроки)
	
	ЗаказОбъект = ЗаказНаПроизводствоТекущий.ПолучитьОбъект();
	СтрокаТЧ = ЗаказОбъект.Продукция.Найти(НомерСтроки, "НомерСтроки");
	СтрокаТЧ.Назначение = Справочники.Назначения.ПустаяСсылка();  
	СвернутьТЧЗаказаНаПроизводство(ЗаказОбъект);
	ЗаказОбъект.Записать();
	
КонецПроцедуры 


Процедура СвернутьТЧЗаказаНаПроизводство(Источник)
	 Запрос = Новый Запрос("ВЫБРАТЬ
	                       |	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	                       |	ЗаказНаПроизводство2_2Продукция.Характеристика КАК Характеристика,
	                       |	ЗаказНаПроизводство2_2Продукция.Упаковка КАК Упаковка,
	                       |	ЗаказНаПроизводство2_2Продукция.КоличествоУпаковок КАК КоличествоУпаковок,
	                       |	ЗаказНаПроизводство2_2Продукция.Количество КАК Количество,
	                       |	ЗаказНаПроизводство2_2Продукция.Спецификация КАК Спецификация,
	                       |	ЗаказНаПроизводство2_2Продукция.Склад КАК Склад,
	                       |	ЗаказНаПроизводство2_2Продукция.Подразделение КАК Подразделение,
	                       |	ЗаказНаПроизводство2_2Продукция.Назначение КАК Назначение,
	                       |	ЗаказНаПроизводство2_2Продукция.ДатаПотребности КАК ДатаПотребности,
	                       |	ЗаказНаПроизводство2_2Продукция.Отменено КАК Отменено,
	                       |	ЗаказНаПроизводство2_2Продукция.ПричинаОтмены КАК ПричинаОтмены,
	                       |	ЗаказНаПроизводство2_2Продукция.ДоляСтоимости КАК ДоляСтоимости,
	                       |	ЗаказНаПроизводство2_2Продукция.ДоляСтоимостиНаЕдиницу КАК ДоляСтоимостиНаЕдиницу,
	                       |	ЗаказНаПроизводство2_2Продукция.СписатьНаРасходы КАК СписатьНаРасходы,
	                       |	ЗаказНаПроизводство2_2Продукция.СтатьяРасходов КАК СтатьяРасходов,
	                       |	ЗаказНаПроизводство2_2Продукция.АналитикаРасходов КАК АналитикаРасходов,
	                       |	ЗаказНаПроизводство2_2Продукция.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов
	                       |ПОМЕСТИТЬ ВТ
	                       |ИЗ
	                       |	&ЗаказНаПроизводство2_2Продукция КАК ЗаказНаПроизводство2_2Продукция
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки,
	                       |	ВТ.Номенклатура КАК Номенклатура,
	                       |	ВТ.Характеристика КАК Характеристика,
	                       |	ВТ.Упаковка КАК Упаковка,
	                       |	СУММА(ВТ.КоличествоУпаковок) КАК КоличествоУпаковок,
	                       |	СУММА(ВТ.Количество) КАК Количество,
	                       |	ВТ.Спецификация КАК Спецификация,
	                       |	ВТ.Склад КАК Склад,
	                       |	ВТ.Подразделение КАК Подразделение,
	                       |	ВТ.Назначение КАК Назначение,
	                       |	ВТ.ДатаПотребности КАК ДатаПотребности,
	                       |	ВТ.Отменено КАК Отменено,
	                       |	ВТ.ПричинаОтмены КАК ПричинаОтмены,
	                       |	СРЕДНЕЕ(ВТ.ДоляСтоимости) КАК ДоляСтоимости,
	                       |	СРЕДНЕЕ(ВТ.ДоляСтоимостиНаЕдиницу) КАК ДоляСтоимостиНаЕдиницу,
	                       |	ВТ.СписатьНаРасходы КАК СписатьНаРасходы,
	                       |	ВТ.СтатьяРасходов КАК СтатьяРасходов,
	                       |	ВТ.АналитикаРасходов КАК АналитикаРасходов,
	                       |	ВТ.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов
	                       |ПОМЕСТИТЬ База
	                       |ИЗ
	                       |	ВТ КАК ВТ
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	ВТ.Номенклатура,
	                       |	ВТ.Характеристика,
	                       |	ВТ.Упаковка,
	                       |	ВТ.Спецификация,
	                       |	ВТ.Склад,
	                       |	ВТ.Подразделение,
	                       |	ВТ.Назначение,
	                       |	ВТ.ДатаПотребности,
	                       |	ВТ.Отменено,
	                       |	ВТ.ПричинаОтмены,
	                       |	ВТ.СтатьяРасходов,
	                       |	ВТ.АналитикаРасходов,
	                       |	ВТ.АналитикаАктивовПассивов,
						   |	ВТ.СписатьНаРасходы
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	База.НомерСтроки КАК НомерСтроки,
	                       |	База.Номенклатура КАК Номенклатура,
	                       |	База.Характеристика КАК Характеристика,
	                       |	База.Упаковка КАК Упаковка,
	                       |	База.КоличествоУпаковок КАК КоличествоУпаковок,
	                       |	База.Количество КАК Количество,
	                       |	База.Спецификация КАК Спецификация,
	                       |	База.Склад КАК Склад,
	                       |	База.Подразделение КАК Подразделение,
	                       |	База.Назначение КАК Назначение,
	                       |	База.ДатаПотребности КАК ДатаПотребности,
	                       |	База.Отменено КАК Отменено,
	                       |	База.ПричинаОтмены КАК ПричинаОтмены,
	                       |	База.ДоляСтоимости КАК ДоляСтоимости,
	                       |	База.ДоляСтоимостиНаЕдиницу КАК ДоляСтоимостиНаЕдиницу,
	                       |	База.СписатьНаРасходы КАК СписатьНаРасходы,
	                       |	База.СтатьяРасходов КАК СтатьяРасходов,
	                       |	База.АналитикаРасходов КАК АналитикаРасходов,
	                       |	База.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов
	                       |ИЗ
	                       |	База КАК База");
	 Запрос.УстановитьПараметр("ЗаказНаПроизводство2_2Продукция", Источник.Продукция.Выгрузить());
	 Выборка = Запрос.Выполнить().Выбрать();
	 Источник.Продукция.Очистить();
	 Пока Выборка.Следующий() Цикл
		 Нов = Источник.Продукция.Добавить();
		 ЗаполнитьЗначенияСвойств(Нов, Выборка);
		 Нов.КлючНоменклатура = Новый УникальныйИдентификатор;
	 КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СвернутьСтрокиТЧТоварыЗаказаКлиента(Источник) 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказКлиентаТовары.Количество КАК Количество,
		|	ЗаказКлиентаТовары.ВидЦены КАК ВидЦены,
		|	ЗаказКлиентаТовары.Цена КАК Цена,
		|	ЗаказКлиентаТовары.Сумма КАК Сумма,
		|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
		|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
		|	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	ЗаказКлиентаТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		|	ЗаказКлиентаТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ЗаказКлиентаТовары.ПричинаОтмены КАК ПричинаОтмены,
		|	ЗаказКлиентаТовары.Отменено КАК Отменено,
		|	ЗаказКлиентаТовары.Склад КАК Склад,
		|	ЗаказКлиентаТовары.СрокПоставки КАК СрокПоставки,
		|	ЗаказКлиентаТовары.Содержание КАК Содержание,
		|	ЗаказКлиентаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ЗаказКлиентаТовары.Серия КАК Серия,
		|	ЗаказКлиентаТовары.НоменклатураНабора КАК НоменклатураНабора,
		|	ЗаказКлиентаТовары.Обособленно КАК Обособленно,
		|	ЗаказКлиентаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ЗаказКлиентаТовары.Подразделение КАК Подразделение,
		|	ЗаказКлиентаТовары.НоменклатураПартнера КАК НоменклатураПартнера,
		|	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
		|	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
		|	ЗаказКлиентаТовары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
		|	ЗаказКлиентаТовары.бит_ВесНетто КАК бит_ВесНетто,
		|	ЗаказКлиентаТовары.бит_ВесБрутто КАК бит_ВесБрутто,
		|	ЗаказКлиентаТовары.бит_ТипТары КАК бит_ТипТары,
		|	ЗаказКлиентаТовары.бит_КоличествоТары КАК бит_КоличествоТары,
		|	ЗаказКлиентаТовары.бит_Намотка КАК бит_Намотка,
		|	ЗаказКлиентаТовары.бит_ИзготовитьК КАК бит_ИзготовитьК
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ТЧбит_Товары КАК ЗаказКлиентаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки,
		|	ВТ_Товары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Упаковка КАК Упаковка,
		|	СУММА(ВТ_Товары.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(ВТ_Товары.Количество) КАК Количество,
		|	ВТ_Товары.ВидЦены КАК ВидЦены,
		|	СРЕДНЕЕ(ВТ_Товары.Цена) КАК Цена,
		|	СУММА(ВТ_Товары.Сумма) КАК Сумма,
		|	ВТ_Товары.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ВТ_Товары.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ВТ_Товары.СуммаСНДС) КАК СуммаСНДС,
		|	СРЕДНЕЕ(ВТ_Товары.ПроцентРучнойСкидки) КАК ПроцентРучнойСкидки,
		|	СУММА(ВТ_Товары.СуммаРучнойСкидки) КАК СуммаРучнойСкидки,
		|	СРЕДНЕЕ(ВТ_Товары.ПроцентАвтоматическойСкидки) КАК ПроцентАвтоматическойСкидки,
		|	ВТ_Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ВТ_Товары.ПричинаОтмены КАК ПричинаОтмены,
		|	ВТ_Товары.Отменено КАК Отменено,
		|	ВТ_Товары.Склад КАК Склад,
		|	ВТ_Товары.СрокПоставки КАК СрокПоставки,
		|	ВТ_Товары.Содержание КАК Содержание,
		|	ВТ_Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ВТ_Товары.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ВТ_Товары.Серия КАК Серия,
		|	ВТ_Товары.НоменклатураНабора КАК НоменклатураНабора,
		|	ВТ_Товары.Обособленно КАК Обособленно,
		|	ВТ_Товары.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ВТ_Товары.Подразделение КАК Подразделение,
		|	ВТ_Товары.НоменклатураПартнера КАК НоменклатураПартнера,
		|	ВТ_Товары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
		|	ВТ_Товары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
		|	ВТ_Товары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
		|	ВТ_Товары.бит_ТипТары КАК бит_ТипТары,
		|	ВТ_Товары.бит_ИзготовитьК КАК бит_ИзготовитьК
		|ПОМЕСТИТЬ ВТ_ТоварыСНумерацией
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.ДатаОтгрузки,
		|	ВТ_Товары.Номенклатура,
		|	ВТ_Товары.Характеристика,
		|	ВТ_Товары.Упаковка,
		|	ВТ_Товары.ВидЦены,
		|	ВТ_Товары.СтавкаНДС,
		|	ВТ_Товары.СуммаАвтоматическойСкидки,
		|	ВТ_Товары.ПричинаОтмены,
		|	ВТ_Товары.Отменено,
		|	ВТ_Товары.Склад,
		|	ВТ_Товары.Содержание,
		|	ВТ_Товары.ВариантОбеспечения,
		|	ВТ_Товары.Серия,
		|	ВТ_Товары.НоменклатураНабора,
		|	ВТ_Товары.Обособленно,
		|	ВТ_Товары.ХарактеристикаНабора,
		|	ВТ_Товары.Подразделение,
		|	ВТ_Товары.НоменклатураПартнера,
		|	ВТ_Товары.СуммаБонусныхБалловКСписанию,
		|	ВТ_Товары.СуммаБонусныхБалловКСписаниюВВалюте,
		|	ВТ_Товары.СуммаНачисленныхБонусныхБалловВВалюте,
		|	ВТ_Товары.СрокПоставки,
		|	ВТ_Товары.СтатусУказанияСерий,
		|	ВТ_Товары.бит_ТипТары,
		|	ВТ_Товары.бит_ИзготовитьК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыСНумерацией.НомерСтроки КАК НомерСтроки,
		|	ВТ_ТоварыСНумерацией.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ВТ_ТоварыСНумерацией.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыСНумерацией.Характеристика КАК Характеристика,
		|	ВТ_ТоварыСНумерацией.Упаковка КАК Упаковка,
		|	ВТ_ТоварыСНумерацией.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТ_ТоварыСНумерацией.Количество КАК Количество,
		|	ВТ_ТоварыСНумерацией.ВидЦены КАК ВидЦены,
		|	ВТ_ТоварыСНумерацией.Цена КАК Цена,
		|	ВТ_ТоварыСНумерацией.Сумма КАК Сумма,
		|	ВТ_ТоварыСНумерацией.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_ТоварыСНумерацией.СуммаНДС КАК СуммаНДС,
		|	ВТ_ТоварыСНумерацией.СуммаСНДС КАК СуммаСНДС,
		|	ВТ_ТоварыСНумерацией.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	ВТ_ТоварыСНумерацией.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ВТ_ТоварыСНумерацией.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		|	ВТ_ТоварыСНумерацией.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ВТ_ТоварыСНумерацией.ПричинаОтмены КАК ПричинаОтмены,
		|	ВТ_ТоварыСНумерацией.Отменено КАК Отменено,
		|	ВТ_ТоварыСНумерацией.Склад КАК Склад,
		|	ВТ_ТоварыСНумерацией.СрокПоставки КАК СрокПоставки,
		|	ВТ_ТоварыСНумерацией.Содержание КАК Содержание,
		|	ВТ_ТоварыСНумерацией.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ВТ_ТоварыСНумерацией.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ВТ_ТоварыСНумерацией.Серия КАК Серия,
		|	ВТ_ТоварыСНумерацией.НоменклатураНабора КАК НоменклатураНабора,
		|	ВТ_ТоварыСНумерацией.Обособленно КАК Обособленно,
		|	ВТ_ТоварыСНумерацией.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ВТ_ТоварыСНумерацией.Подразделение КАК Подразделение,
		|	ВТ_ТоварыСНумерацией.НоменклатураПартнера КАК НоменклатураПартнера,
		|	ВТ_ТоварыСНумерацией.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
		|	ВТ_ТоварыСНумерацией.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
		|	ВТ_ТоварыСНумерацией.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
		|	ВТ_ТоварыСНумерацией.НомерСтроки КАК КодСтроки,
		|	ВТ_ТоварыСНумерацией.НомерСтроки КАК КлючСвязи,
		|	ВТ_ТоварыСНумерацией.бит_ТипТары КАК бит_ТипТары,
		|	ВТ_ТоварыСНумерацией.бит_ИзготовитьК КАК бит_ИзготовитьК
		|ИЗ
		|	ВТ_ТоварыСНумерацией КАК ВТ_ТоварыСНумерацией";
		
		ТЧбит_Товары = Источник.Товары.Выгрузить();
		
		Запрос.УстановитьПараметр("ТЧбит_Товары", ТЧбит_Товары);
		
		РезультатЗапроса= Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();

		Источник.Товары.Очистить();
		
		Пока Выборка.Следующий() Цикл	
			НоваяСтрока = Источник.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);  
			НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор(); 
			
			// посчитаем добавленные поля типа намотка, тара и т.п.
			Если ЗначениеЗаполнено(НоваяСтрока.бит_ТипТары) Тогда
		    	Намотка = ПолучитьНамоткуНоменклатуры(НоваяСтрока.Номенклатура, НоваяСтрока.Упаковка, НоваяСтрока.бит_ТипТары);
				Если НоваяСтрока.бит_Намотка > Намотка Тогда
			    	НоваяСтрока.бит_Намотка = Намотка;
				КонецЕсли;
				РасчитатьВес(НоваяСтрока, НоваяСтрока.бит_Намотка);
			Иначе
				НоваяСтрока.бит_Намотка = 0;
			КонецЕсли;	
		КонецЦикла;  
		Источник.бит_ИтогоНетто = Источник.Товары.Итог("бит_ВесНетто");
		Источник.бит_ИтогоБрутто = Источник.Товары.Итог("бит_ВесБрутто");
		
КонецПроцедуры

#Область ИЗФормыРасширенияЗаказКлиента

&НаСервереБезКонтекста
Функция ПолучитьНамоткуНоменклатуры(НоменклатураГП, УпаковкаГП, НоменклатураТара)

 	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] +
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НамоткаНоменклатуры.НоменклатураГП КАК НоменклатураГП,
		|	бит_НамоткаНоменклатуры.ЕдИзм КАК ЕдИзм,
		|	бит_НамоткаНоменклатуры.НоменклатураТара КАК НоменклатураТара,
		|	бит_НамоткаНоменклатуры.Намотка КАК Намотка,
		|	бит_НамоткаНоменклатуры.Несопоставимо КАК Несопоставимо
		|ИЗ
		|	РегистрСведений.бит_НамоткаНоменклатуры КАК бит_НамоткаНоменклатуры
		|ГДЕ
		|	бит_НамоткаНоменклатуры.НоменклатураГП = &НоменклатураГП
		//|	И бит_НамоткаНоменклатуры.ЕдИзм = &ЕдИзм
		|	И бит_НамоткаНоменклатуры.НоменклатураТара = &НоменклатураТара";
	
	Запрос.УстановитьПараметр("ЕдИзм", УпаковкаГП);
	Запрос.УстановитьПараметр("НоменклатураГП", НоменклатураГП);
	Запрос.УстановитьПараметр("НоменклатураТара", НоменклатураТара);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Несопоставимо Тогда
			
			Возврат - 1;	
			
		Иначе
			
			Возврат ВыборкаДетальныеЗаписи.Намотка;	
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат -1;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] -
  
КонецФункции

&НаСервереБезКонтекста
Процедура РасчитатьВес(ТекущиеДанные, Намотка)
	// взято из расширения из формы заказа клиента
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] +
	
	//_1 "Вес нетто, т" - автоматический расчет (например 1км ГП весит 0,01т - заказали 10 км ГП - Вес нетто = 0,1т)
	//_2 "Вес брутто, т" - автоматический расчет 
	//(например 1км ГП весит 0,01т; 1 шт Тары весит 0,01т - заказали 10 км ГП 
	//(согласно Регистру сведений на 1 шт Тары максимально наматывается 5 км, т.е. необходимо 2шт Тары для намотки 10 км ГП) - Вес брутто = 0,12т)
	//_3 "Тип тары" (номенклатура) - заполняется из справочника Номенклатура - Вид номенклатуры - Тара
	//_4 "Количество тары" - автоматический расчет 
	//(например заказали 10 км ГП, указали Тип тары 
	//(согласно Регистру сведений на 1 шт Тары максимально наматывается 5 км) - Количество тары = 2 шт)
	//_5 "Намотка" - автоматическое заполнение из Регистра сведений (максимальное значение). 
	//При необходимости (по запросу клиента) изменяется на меньшее значение и производится автоматический пересчет значений "Количество тары", "Вес брутто".
				
	Если ТекущиеДанные <> Неопределено Тогда
		
		ВесНетто = ПолучитьВесНоменклатуры(ТекущиеДанные.Номенклатура, ТекущиеДанные.Упаковка);
		ТекущиеДанные.бит_ВесНетто = ВесНетто * ТекущиеДанные.КоличествоУпаковок;
		
		Если Намотка <> 0 Тогда
			ТекущиеДанные.бит_КоличествоТары = ТекущиеДанные.КоличествоУпаковок / Намотка;
		Иначе
			ТекущиеДанные.бит_КоличествоТары = 0;
			ТекущиеДанные.бит_Намотка = 0;	
		КонецЕсли;	
			
		Если Цел(ТекущиеДанные.бит_КоличествоТары) <> ТекущиеДанные.бит_КоличествоТары Тогда
			ТекущиеДанные.бит_КоличествоТары = Цел(ТекущиеДанные.бит_КоличествоТары) + 1;	
		КонецЕсли;
		
		ВесНетто = ПолучитьВесНоменклатуры(ТекущиеДанные.бит_ТипТары, ТекущиеДанные.Упаковка);
		ТекущиеДанные.бит_ВесБрутто = ТекущиеДанные.бит_ВесНетто + (ВесНетто * ТекущиеДанные.бит_КоличествоТары);
		
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВесНоменклатуры(Номенклатура, Упаковка)
	
	Возврат Номенклатура.ВесЧислитель;
	
КонецФункции  

#КонецОбласти

&НаКлиенте
Процедура ЗаказыНаПроизводствоЗаказНаПроизводствоНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуБронирования(Команда)  
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ЗаказКлиента = Параметры.ЗаказКлиента;
	Исполнение	 = Параметры.Исполнение;
	Сечение		 = Параметры.Сечение;
	Марка		 = Параметры.Марка;
	Номенклатура 		= Параметры.Номенклатура;
	КБронированиюВсего	= Параметры.Количество; 
	КРаспределению		= Параметры.Количество;
	Обособленно	 		= Параметры.Обособленно;      
	
	ЗаполнитьТЧЗаказыНаПроизводство(); 
	
КонецПроцедуры                        

&НаСервере
Процедура ЗаполнитьТЧЗаказыНаПроизводство()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Т.Распоряжение КАК ЗаказНаПроизводство,
	                      |	ИСТИНА КАК ТребуетсяПланирование
	                      |ПОМЕСТИТЬ втТребуетсяПланирование
	                      |ИЗ
	                      |	РегистрСведений.ЗаданияКРасчетуГрафикаПроизводства КАК Т
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ
	                      |	Т.ЗаказНаПроизводство,
	                      |	ИСТИНА
	                      |ИЗ
	                      |	РегистрСведений.ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства КАК Т
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВЫРАЗИТЬ(ЗапасыИПотребностиОбороты.Регистратор КАК Документ.ЗаказНаПроизводство2_2) КАК ЗаказНаПроизводство,
	                      |	ЗапасыИПотребностиОбороты.Номенклатура КАК Номенклатура
	                      |ПОМЕСТИТЬ втЗаказы
	                      |ИЗ
	                      |	РегистрНакопления.ЗапасыИПотребности.Обороты(
	                      |			,
	                      |			,
	                      |			Регистратор,
	                      |			Заказ ССЫЛКА Документ.ЗаказНаПроизводство2_2
	                      |				И Номенклатура = &Номенклатура) КАК ЗапасыИПотребностиОбороты
	                      |ГДЕ
	                      |	ЗапасыИПотребностиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаПроизводство2_2
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втЗаказы.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	                      |	втЗаказы.ЗаказНаПроизводство.ДатаПотребности КАК ЖелаемаяДатаВыпуска,
	                      |	СУММА(ЗаказНаПроизводство2_2Продукция.Количество) КАК ОбъемВЗаказе,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ЗаказНаПроизводство2_2Продукция.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	                      |				ТОГДА ЗаказНаПроизводство2_2Продукция.Количество
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК ДоступноКБронированию,
	                      |	влПлановаяДата.ПлановаяДатаВыпуска КАК ПлановаяДатаВыпуска,
	                      |	ЕСТЬNULL(втТребуетсяПланирование.ТребуетсяПланирование, ЛОЖЬ) КАК ТребуетсяПерепланирование
	                      |ИЗ
	                      |	втЗаказы КАК втЗаказы
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	                      |		ПО втЗаказы.ЗаказНаПроизводство = ЗаказНаПроизводство2_2Продукция.Ссылка
	                      |			И втЗаказы.Номенклатура = ЗаказНаПроизводство2_2Продукция.Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			втЗаказы.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	                      |			МАКСИМУМ(ЕСТЬNULL(ГрафикЭтаповПроизводства2_2.Окончание, ДАТАВРЕМЯ(1, 1, 1))) КАК ПлановаяДатаВыпуска
	                      |		ИЗ
	                      |			втЗаказы КАК втЗаказы
	                      |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикЭтаповПроизводства2_2
	                      |				ПО втЗаказы.ЗаказНаПроизводство = ГрафикЭтаповПроизводства2_2.ЗаказНаПроизводство
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			втЗаказы.ЗаказНаПроизводство) КАК влПлановаяДата
	                      |		ПО втЗаказы.ЗаказНаПроизводство = влПлановаяДата.ЗаказНаПроизводство
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втТребуетсяПланирование КАК втТребуетсяПланирование
	                      |		ПО втЗаказы.ЗаказНаПроизводство = втТребуетсяПланирование.ЗаказНаПроизводство
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	втЗаказы.ЗаказНаПроизводство,
	                      |	втЗаказы.ЗаказНаПроизводство.ДатаПотребности,
	                      |	влПлановаяДата.ПлановаяДатаВыпуска,
	                      |	ЕСТЬNULL(втТребуетсяПланирование.ТребуетсяПланирование, ЛОЖЬ)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ЗаказНаПроизводство"); 
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	ЗаказыНаПроизводство.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаПроизводствоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	ЗаказНаПроизв = Элемент.ТекущиеДанные.ЗаказНаПроизводство;
	ОткрытьЗначение(ЗаказНаПроизв); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаПроизводствоПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.ЗаказыНаПроизводство.ТекущиеДанные;
	Если ТД <> Неопределено Тогда   
		ЗаказНаПроизводствоТекущий = ТД.ЗаказНаПроизводство;
		ПерезаполнитьТЧЗаказа(ТД.ЗаказНаПроизводство);   
	Иначе
		ЗаказНаПроизводствоТекущий = ПредопределенноеЗначение("Документ.ЗаказНаПроизводство2_2.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТЧЗаказа(ЗаказНаПроизводство, Доступно = Неопределено)
	
	//Если Доступно = Неопределено Тогда
		Доступно = 0;
	//КонецЕсли;
	
	ТаблицаТоваров.Очистить();
	Для каждого стр из ЗаказНаПроизводство.Продукция Цикл 
		Если стр.Номенклатура <> Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		
		нов = ТаблицаТоваров.Добавить(); 
		нов.НомерСтроки = стр.НомерСтроки;
		нов.Назначение = стр.Назначение;
		нов.Количество = стр.Количество;
		Если ЗначениеЗаполнено(стр.Назначение) 
			И ЗначениеЗаполнено(стр.Назначение.Заказ) 
			И ТипЗнч(стр.Назначение.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				нов.КомментарийКЗаказу = стр.Назначение.Заказ.Комментарий;     
				нов.Толеранс = стр.Назначение.Заказ.бит_Толеранс;
		КонецЕсли;
		 
		Если Не ЗначениеЗаполнено(стр.Назначение) Тогда
			Доступно = Доступно + стр.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
